package com.dy.baseutils.module.newsshow.bean;

import java.io.Serializable;

/**
 * Auth : dy
 * Time : 2017/1/22 11:25
 * Email: dymh21342@163.com
 * Description:
 */

public class ViewMsg implements Serializable{
    public String title;
    public String msg;
    public String text_subtitle_left;
    public String text_subtitle_right;


    public static ViewMsg getDetailTest(){
        ViewMsg view = new ViewMsg();
        view.title = "在生态之痛中苏醒";
        view.msg = "　河西走廊上的那座古城，曾经繁荣强盛，却在一夜之间被风沙吞没，徒留遍地瓦砾——“黑水国”的不老传说，仿若鸣响千百年的警钟。岁末年初，记者驻足黑水城遗址，似乎听到历史的回声：传说中的悲剧会重演吗？\n" +
                "　　仰望中国版图，青藏高原向下一顿，“挤”出内蒙古高原和黄土高原。一座西北——东南走向的山脉，成为阶梯分界线，向内地铺排。倘若没有这座山，西面塔克拉玛干沙漠、北边腾格里沙漠、南侧柴达木沙漠，将席卷连片，直逼西北，觊觎华北；干热风暴，会直扑“中华水塔”三江源。\n" +
                "　　这座山，还是天然的固体水库，其冰雪消融，孕育石羊河、黑河、疏勒河三大内陆河，滋养黄河、青海湖，哺育戈壁绿洲河西走廊……\n" +
                "　　这就是祁连山，防风蓄水的“风水”宝地。没有五岳，中国会少几道风景；失我祁连，中国地理格局将发生巨变！\n" +
                "　　筑牢这道西部生态安全屏障，历史性地摆在了国家面前。\n" +
                "　　牛羊超载，开山挖矿\n" +
                "　　草原不能承受之痛\n" +
                "　　抵兰州，过乌鞘岭，进祁连山。一路向西，荒凉渐显。\n" +
                "　　祁连山地处甘肃、青海两省交界，“偏向”甘肃，绵延800多公里，其中600多公里在甘肃省张掖市肃南裕固族自治县境内。\n" +
                "　　秋冬草黄，肃南萧瑟。\n" +
                "　　“小时候，草场软绵绵的，夏天满山都是黄色小花。”1月10日，肃南雷山夏季牧场，全国人大代表、大河乡大滩村的“85后”牧民常海霞蹲在地上，扒开一丛刚过脚脖子的灌木——金露梅。在常海霞的记忆中，草长得好的地方，金露梅也长得高。让她遗憾的是，儿时满山怒放的黄色小花，如今只能梦中寻。\n" +
                "　　祁连山是我国六大天然牧场之一，可利用草场九成在甘肃。过去，甘青两省许多牧民家庭收入主要靠放牧。上世纪80年代后，草原承包到户，人口增多，牛羊越多，钱包越鼓，牲畜超载比较普遍。\n" +
                "　　民盟甘肃省委组织专家调研发现：1980年至1988年，过度放牧等因素导致甘肃祁连山草地退化约五成。青海境内海拔较高，退化更严重。进入上世纪90年代，草原退化加剧。\n" +
                "　　靠山吃山，静谧的草原成为“香饽饽”。在祁连山区，县与县、乡与乡，常为“占山”放牧而发生纠纷。2013年7月，在甘青交界某处公共牧场，青海祁连县和甘肃民乐县一些牧民“抢地盘”，百余人操家伙混战，最终导致14人受伤。原本地缘相近、人缘相亲，谁来了都一起吃肉喝酒。无奈牛羊多、草场少，“寸草不让”，甚至出现“姐夫揍了小舅子”的现象。\n" +
                "　　近年来，随着环保力度加大，祁连山草原逐渐恢复，但两省一些地方仍存在不同程度超载。甘肃祁连山国家级自然保护区有76%面积在张掖市境内，去年张掖的草原超载率约为24%。\n" +
                "　　过牧对草原的伤害相对缓慢，当轰鸣的机械开进草原，则像“公牛闯进了瓷器店”。\n" +
                "　　2014年8月，青海木里煤田露天开采破坏草原，上了各大新闻网站头条。木里矿区紧靠青海祁连山保护区，部分矿点涉及保护区。那时，挖掘机轰隆开进草原，挖出10多个、最深约200米的矿坑，撕裂青青草原，留下黑黑伤口。后来，木里矿区停产整顿，涉及保护区的多处矿点注销，被依法处置。\n" +
                "　　木里煤田平均海拔4000米以上，高寒缺氧，入冬后无法施工，一些企业生态治理资金断供。记者遥望矿坑，回想当年的绿色，又睹木里之殇：在生态脆弱的高原，恢复生态谈何容易！";
        view.text_subtitle_right="2017-02-06";
        return view;
    }

}
